export const smartCities = [
  { 
    id: 1,
    name: "Лондон",
    coordinates: [51.5074456, -0.1277653],
    description: "Лондон, є одним з найважливіших фінансових центрів Європи. Найсильніші його сторони - це економіка, людський капітал, міжнародні зв'язки, технології і мобільність. Розумне місто Лондона залучило програмістів і стартапів більше, ніж майже будь-яке місто світу.",
  },
  { 
    id: 2,
    name: "Нью Йорк",
    coordinates: [40.7127281, -74.0060152],
    description: "Нью-Йорк, одне з найпотужніших міст світу, опустилось на другу сходинку в рейтингу, навіть не дивлячись не той факт, що було номером один протягом останніх трьох років. Тим не менше Нью-Йорк залишається провідним містом за економічними показниками через найвищий в рейтингу ВВП.",
  },
  { 
    id: 3,
    name: "Амстердам",
    coordinates: [52.3730796, 4.8924534],
    description: "Амстердам виділяється в міжнародному прогресі. Місто має десяте місце в економіці, сьоме за технологічним розвитком і залишається в топ-20 майже за всіма іншими вимірами. Місто виявилося важливою європейською силою для FinTech, енергоефективності та культури.",
  },
  { 
    id: 4,
    name: "Сінгапур",
    coordinates: [1.357107, 103.8194992],
    description: "Сінгапур - найкраще місто за розміром технологій. Місто забезпечує найшвидшу швидкість Інтернету для своїх громадян, і майже 100% населення користується мобільними телефонами. У ньому дуже багата технологічна культура: лікарні мають персонал людей та роботів, автономні таксі, вертикальні ферми та сади з контрольованою температурою та багато іншого. Також місто стоїть під номером 10 за охороною навколишнього середовища.",
  },
]