export const factorQuestionName = {
  structures: {
    health_safety: [
      "Базові санітарні умови відповідають потребам найбідніших районів",
      "Послуги з утилізації задовільні",
      "Громадська безпека не є проблемою",
      "Забруднення повітря не є проблемою",
      "Надання медичних послуг задовільний",
      "Знайти житло з орендною платою в розмірі 30% або менше місячної зарплати не проблема",
    ],
    mobility: [
      "Затори не є проблемою",
      "Громадський транспорт задовільний",
    ],
    activities: [
      "Зелені насадження задовільні",
      "Культурна діяльність (шоу, бари, музеї) задовільна",
    ],
    opportunities: [
      "Послуги з пошуку роботи доступні",
      "Більшість дітей мають доступ до хорошої школи",
      "Можливості навчання впродовж життя надають місцеві установи",
      "Підприємства створюють нові робочі місця",
      "Меншини відчувають себе бажаними",
    ],
    governance: [
      "Інформація про рішення місцевої влади є легкодоступною",
      "Корупція міської влади не викликає занепокоєння",
      "Мешканці беруть участь у прийнятті рішень місцевої влади",
      "Мешканці надають відгуки про проекти місцевого самоврядування",
    ],
  },
  technologies: {
    health_safety: [
      "Онлайн-повідомлення про проблеми з утриманням міста забезпечує швидке вирішення",
      "Веб-сайт або додаток дозволяє мешканцям легко віддавати непотрібні речі",
      "Безкоштовний громадський Wi-Fi покращив доступ до міських послуг",
      "Камери відеоспостереження змусили жителів почуватися безпечніше",
      "Веб-сайт або додаток дозволяє мешканцям ефективно контролювати забруднення повітря",
      "Запис на прийом до лікаря онлайн покращив доступ",
    ],
    mobility: [
      "Програми для спільного використання автомобілів зменшили затори",
      "Програми, які спрямовують вас до вільного паркувального місця, скорочують час у дорозі",
      "Прокат велосипедів зменшив затори",
      "Онлайн-розклад і продаж квитків спростили користування громадським транспортом",
      "Місто надає інформацію про затори через мобільні телефони",
    ],
    activities: [
      "Онлайн-купівля квитків на вистави та музеї полегшила відвідування",
    ],
    opportunities: [
      "Онлайн-доступ до списків вакансій полегшив пошук роботи",
      "ІТ-навички добре навчають у школах",
      "Онлайн-сервіси, які надає місто, полегшили відкриття нового бізнесу",
      "Поточна швидкість і надійність Інтернету відповідають потребам підключення",
    ],
    governance: [
      "Онлайн-доступ громадян до міських фінансів зменшив корупцію",
      "Інтернет-голосування збільшило кількість учасників",
      "Онлайн-платформа, де мешканці можуть пропонувати ідеї, покращила життя міста",
      "Обробка ідентифікаційних документів онлайн скоротила час очікування",
    ],
  },
}

export const smartCities = {
  pop: { 
    id: 4,
    name: 'Абу-Дабі',
    country: "Об'єднані Арабські Емірати",
    coordinates: [24.4538352, 54.3774014],
    content: {
      properties: {},
      description: "столиця Об'єднаних Арабських Еміратів та емірату Абу-Дабі.",
      rank: 13,
      shifted_place: -1,
      HDI: 0.991,
      general_rating: 'AAA',
      structures_rating: 'BB',
      technologies_rating: 'BB',
      main_statistic: [
        {
          [2018]: 0.55,
          [2019]: 0.866,
          [2020]: 0.866,
          [2021]: 0.866,
          now: 0.866,
        },
        {
          [2018]: 0.866,
          [2019]: 0.866,
          [2020]: 0.866,
          [2021]: 0.866,
          now: 0.866,
        },
        {
          [2018]: 0.866,
          [2019]: 0.866,
          [2020]: 0.866,
          [2021]: 0.866,
          now: 0.866,
        },
        {
          [2018]: 0.866,
          [2019]: 0.866,
          [2020]: 0.866,
          [2021]: 0.866,
          now: 0.866,
        },
        {
          [2018]: 0.866,
          [2019]: 0.866,
          [2020]: 0.866,
          [2021]: 0.866,
          now: 0.866,
        },
      ],
      factor_statistic: {
        structures: {
          health_safety: [
            {
              min: 0,
              average: 50,
              max: 100,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
          mobility: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
          activities: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
          opportunities: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
          ],
          governance: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
        },
        technologies: {
          health_safety: [
            {
              min: 5,
              average: 24,
              max: 80,
            },
            {
              min: 32,
              average: 50,
              max: 85,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
          mobility: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
          ],
          activities: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
          ],
          opportunities: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
          governance: [
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
            {
              min: 35,
              average: 64,
              max: 85,
            },
            {
              min: 10,
              average: 25,
              max: 67,
            },
          ],
        },
      },
      rows: [
        {
          properties: {},
          elements: [
            {
              space: 2/3,
              type: "text",
              text: "Сінгапур - найкраще місто за розміром технологій. Місто забезпечує найшвидшу швидкість Інтернету для своїх громадян, і майже 100% населення користується мобільними телефонами. У ньому дуже багата технологічна культура: лікарні мають персонал людей та роботів, автономні таксі, вертикальні ферми та сади з контрольованою температурою та багато іншого. Також місто стоїть під номером 10 за охороною навколишнього середовища."
            },
            {
              space: 1/3,
              type: "image",
              font_size: 3,
              image_url: "https://media.gettyimages.com/photos/aerial-panorama-of-st-michael-goldendomed-monastery-ministry-of-and-picture-id932826114",
              text: "Ось так"
            }
          ],
        },
        {
          properties: {
            height: 1,
          },
          elements: [
            {
              space: 1/3,
              type: "text",
              text: "тут щось"
            },
            {
              space: 2/3,
              type: "text",
              text: "і тут"
            }
          ],
        },
        {
          properties: {},
          elements: [
            {
              space: 1/4,
              type: "image",
              image_url:"https://th.bing.com/th/id/R.c327c0e4318b08c3f9ed9c4dc57f7dec?rik=v1rQ%2foEyL7vjbg&pid=ImgRaw&r=0",
            },
            {
              space: 2/4,
              type: "header",
              text: "Супер важлива інфа"
            },
            {
              space: 1/4,
              type: "image",
              image_url: "https://th.bing.com/th/id/OIP.216g-WQs1oH6fyKe00KdZgHaEK?rs=1&pid=ImgDetMain",
            }
          ],
        },
      ]
    },
  },
}